examples/porousHeatTransferFoam/PCMValidations/givenPressure/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue pcm1.solid 1
	volScalarFieldValue pcm2.solid 0
);

regions
(
    // Set patch values (using ==)
    boxToCell
    {
        box (-10 0 -10) (10 0.1 10);
	//	box (2.5 -1000 2.5) (7.5 1000 7.5);
	//	box (-2.5 -1000 -2.5) (17.5 1e5 17.5);

        fieldValues
        (
            volScalarFieldValue pcm1.solid 0
			volScalarFieldValue pcm2.solid 1
        );
    }
);

// ************************************************************************* //
